STRINGS = {
    1: """🎇 **- شكراً لتنصيبك سورس سيمو **
•• من الاسفل بعض الخيارات التي ستساعدك في سيمو.""",
    2: """🎉** حول سيمو**
🧿 سيمو هو يوزربوت في مكتبة التيليثون تم صنعه بأستخدام البايثون. يحتوي على اكثر من 100 أمر تساعدك في التليجرام و سيمو هو افضل سورس من ناحية الامان.
❣ قناة السورس **@FTTUTY**""",
    3: """**💡• قنوات السورس •**
قناة الكلايش:  @FPPUPP1
قناة الشروحات: @FTTUTT7
قناة السورس: @FTTUTY
مجموعة المساعدة: @FTTUTT0""",
    4: f"""• `لمعرفة جميع اوامر السورس ارسل`
  - `.اوامري`
  - `.الاوامر`""",
    5: """• **لأي مساعدة ثانية **
  - أنضم في مجموعة المساعدة **@FTTUTT0**.
• شكرا لك لقرائتك هذه المقالة.""",
}
